# Работа с переменными:
# 1 Переменной var_int присвойте значение 10, var_float - значение 8.4, var_str - "No".
from plistlib import dumps

var_int = 10
var_float = 8.4
var_str = "No"

print(var_int, type(var_int))
print(var_float, type(var_float))
print(var_str, type(var_str))

# 2 Измените значение, хранимое в переменной var_int, увеличив его в 3.5 раза,
# результат свяжите с переменной big_int.

var_int *= 3.5
big_int = var_int
print(big_int)

# 3 Измените значение, хранимое в переменной var_float, уменьшив его на единицу,
# результат свяжите с той же переменной.

var_float -= 1
big_int = var_float
print(big_int)

# ? 4 Разделите var_int на var_float, а затем big_int на var_float. Результат данных
# выражений не привязывайте ни к каким переменным.

print(var_int / var_float)
print(big_int / var_float)

# 5 Измените значение переменной var_str на "NoNoYesYesYes". При формировании
# нового значения используйте операции конкатенации (+) и повторения строки (*).

var_no = "No"
var_yes = "Yes"
var_str = var_no * 2 + var_yes *3
print(var_str)

# 6 Выведите значения всех переменных.
print(var_str, var_int, var_float, big_int)

# Строки:
# 1 Свяжите переменную с любой строкой, состоящей не менее чем из 8 символов.
# Извлеките из строки первый символ, затем последний, третий с начала и третий с
# конца. Измерьте длину вашей строки.

text = "TextText"
print(text[1] + text[3] + text[5:7]) #пропустили первый символ [0], третий [2], пятый [4], восьмой [7]

# 2 Присвойте произвольную строку длиной 10-15 символов переменной и извлеките из
# нее следующие срезы:
# первые восемь символов
# четыре символа из центра строки
# символы с индексами кратными трем
# переверните строку

string = "Программирование"

first_eight = string[:8] # Первые восемь символов
center_four = string[(len(string)//2 - 2):(len(string)//2 + 2)] # Четыре символа из центра строки
indexes_multiple_of_three = string[::3] # Символы с индексами, кратными трём
reversed_string = string[::-1] # Реверс

print(f"Оригинальная строка: {string}")
print(f"Первые восемь символов: {first_eight}")
print(f"Четыре символа из центра строки: {center_four}")
print(f"Символы с индексами, кратными трём: {indexes_multiple_of_three}")
print(f"Перевёрнутая строка: {reversed_string}")

# 3 Есть строка: “my name is name”. Напечатайте ее, но вместо 2ого “name” вставьте
# ваше имя.

string = "my name is name"
name_string = string[:11]
my_name = "Ulyana"

print(name_string+my_name)

# 4 Есть строка: test_tring = "Hello world!", необходимо
# напечатать на каком месте находится буква w
# кол-во букв l
# Проверить начинается ли строка с подстроки: “Hello”
# Проверить заканчивается ли строка подстрокой: “qwe”

# Списки:
# 1 Создайте два любых списка и свяжите их с переменными.

a_list = [1, 2, 3, 4, 5]
b_list = [6, 7, 8, 9, 10]

# ?2 Извлеките из первого списка второй элемент.

second_element = a_list[1]

# 3 Измените во втором списке последний элемент. Выведите список на экран.

b_list[-1] = "changed"
print(b_list)

# 4 Соедините оба списка в один, присвоив результат новой переменной. Выведите
# получившийся список на экран.

both_lists = a_list + b_list
print(both_lists)

# 5 "Снимите" срез из соединенного списка так, чтобы туда попали некоторые части
# обоих первых списков. Срез свяжите с очередной новой переменной. Выведите
# значение этой переменной.
# 6 Добавьте в список два новых элемента и снова выведите его.
# 7 Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для этих двух
# списков. -- !не использовать циклы
# 8 Есть список: [1, 2, 3, 4, 3, 2, 5, 1, 4, 6, 7, 1, 8, 2, 3] оставить в нем только уникальные
# значения. !не использовать циклы


# Логические операции:
# 1 Присвойте двум переменным любые числовые значения.

var_a = 13
var_b = 100

# 2 Составьте четыре сложных логических выражения с помощью оператора and, два из
# которых должны давать истину, а два других - ложь.

if var_a+var_b > 100 and var_b-var_a < 113: #True
    print("True for var_a+var_b > 100 and var_b-var_a < 113")
else:
    print("False for var_a+var_b > 100 and var_b-var_a < 113")

if var_b-var_a > 10 and var_a/var_b > 0: #True
    print("True for var_b-var_a > 10 and var_a/var_b > 0")
else:
    print("False for var_b-var_a > 10 and var_a/var_b > 0")

if var_a*var_b > 100 and var_a/var_b < 0: #False (True and False)
    print("True for var_a*var_b > 100 and var_a/var_b < 0")
else:
    print("False for var_a*var_b > 100 and var_a/var_b < 0")

if var_a+var_b == 120 and var_a/var_b > 2: #False and False
    print("True for var_a+var_b == 120 and var_a/var_b > 2")
else:
    print("False for var_a+var_b == 120 and var_a/var_b > 2")

# 3 Аналогично выполните п. 2, но уже используя оператор or.

if var_b-var_a > 10 or var_a/var_b > 0: #True
    print("Or: True for var_b-var_a > 10 and var_a/var_b > 0")
else:
    print("Or: False for var_b-var_a > 10 and var_a/var_b > 0")

if var_a*var_b > 100 or var_a/var_b < 0: #True (True and False)
    print("Or: True for var_a*var_b > 100 and var_a/var_b < 0")
else:
    print("Or: False for var_a*var_b > 100 and var_a/var_b < 0")

if var_a+var_b == 120 or var_a/var_b > 2: #False and False
    print("Or: True for var_a+var_b == 120 and var_a/var_b > 2")
else:
    print("Or: False for var_a+var_b == 120 and var_a/var_b > 2")

# 4 Попробуйте использовать в сложных логических выражениях работу с переменными
# строкового типа.



# Словари:
# 1 Создайте словарь, связав его с переменной school, и наполните его данными,
# которые бы отражали количество учащихся в десяти разных классах (например, 1а, 1б,
# 2б, 6а, 7в и т.д.).

dict_school = {"1а":30, "1б":25, "2б":22, "6а":28, "7в":26}

# 2 Узнайте сколько человек в каком-нибудь классе.

print(dict_school["1а"])

# 3 Представьте, что в школе произошли изменения, внесите их в словарь:
# ◦ в трех классах изменилось количество учащихся;

dict_school["1а"] = 29
dict_school["1б"] = 27
dict_school["2б"] = 23

# ◦ в школе появилось два новых класса;

dict_school["8в"] = 18
dict_school["9а"] = 30

# ◦ в школе расформировали один из классов.

dict_school.pop("6а")

# 4 Выведите содержимое словаря на экран.

print(dict_school)



# Преобразование типов
# 1
# Перевести строку в массив
# "Robin Singh" => ["Robin”, “Singh"]
# "I love arrays they are my favorite" => ["I", "love", "arrays", "they", "are", "my", "favorite"]

var_c = "Robin Singh"
var_c = var_c.split()
print(var_c)

# 2
# Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
# Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”

ivan_list = ["Ivan", "Ivanou"]
ivan_string = " ".join(ivan_list)
minsk_string = "Minsk"
belarus_string = "Belarus"
print(f"Привет,"+ivan_string+"! Добро пожаловать в "+minsk_string+" "+belarus_string)


# 3
# Дан список ["I", "love", "arrays", "they", "are", "my", "favorite"] сделайте из него
# строку => "I love arrays they are my favorite"
# 4
# Создайте список из 10 элементов, вставьте на 3-ю позицию новое значение,
# удалите элемент из списка под индексом 6
# 5
# Есть 2 словаря
# a = { 'a': 1, 'b': 2, 'c': 3}
# b = { 'c': 3, 'd': 4,'e': 5}
# Необходимо их объединить по ключам, а значения ключей поместить в список, если у
# одного словаря есть ключ "а", а у другого нету, то поставить значение None на
# соответствующую позицию(1-я позиция для 1-ого словаря, вторая для 2-ого)
# ab = {'a': [1, None], 'b': [2, None], 'c': [3, 3], 'd': [None, 4], 'e': [None, 5]}
# *1) Вам передан массив чисел. Известно, что каждое число в этом массиве имеет пару,
# кроме одного: [1, 5, 2, 9, 2, 9, 1] => 5
# Напишите программу, которая будет выводить уникальное число
#*2) Дан текст, который содержит различные английские буквы и знаки препинания. Вам
# необходимо найти самую частую букву в тексте. Результатом должна быть буква в
# нижнем регистре.
# При поиске самой частой буквы, регистр не имеет значения, так что при подсчете
# считайте, что "A" == "a". Убедитесь, что вы не считайте знаки препинания, цифры и
# пробелы, а только буквы.
# Если в тексте две и больше буквы с одинаковой частотой, тогда результатом будет
# буква, которая идет первой в алфавите. Для примера, "one" содержит "o", "n", "e" по
# одному разу, так что мы выбираем "e".
# "a-z" == "a"
# "Hello World!" == "l"
# "How do you do?" == "o"
# "One" == "e"
# "Oops!" == "o"
# "AAaooo!!!!" == "a"
# "a" * 9000 + "b" * 1000 == "a"



# Условия
# 1
# Дано целое число. Если оно является положительным, то прибавить к нему 1; в
# противном случае не изменять его. Вывести полученное число.

i = 27
if i > 0:
    i = i+1
    print(i)
else:
    print(i)

# 2
# Даны три целых числа. Найти количество положительных чисел в исходном
# наборе.

int_a = 3
int_b = -5
int_c = 16

int_count = 0
if int_a > 0:
    int_count += 1
if int_b > 0:
    int_count += 1
if int_c > 0:
    int_count += 1

print(f"Количество положительных чисел: {int_count}")

# 3
# Дан номер года (положительное целое число). Определить количество дней в
# этом году, учитывая, что обычный год насчитывает 365 дней, а високосный — 366
# дней. Високосным считается год, делящийся на 4, за исключением тех годов, которые
# делятся на 100 и не делятся на 400 (например, годы 300, 1300 и 1900 не являются
# високосными, а 1200 и 2000 являются).
# 4
# Дано целое число в диапазоне 1–7. Вывести строку — название дня недели,
# соответствующее данному числу (1 — «понедельник», 2 — «втор- ник» и т. д.).
# 5
# Единицы массы пронумерованы следующим образом: 1 — килограмм, 2 —
# миллиграмм, 3 — грамм, 4 — тонна, 5 — центнер. Дан номер едини- цы массы (целое
# число в диапазоне 1–5) и масса тела в этих единицах (вещественное число). Найти
# массу тела в килограммах.



# Цикл for
# 1
# Даны два целых числа A и B (A < B). Найти сумму всех целых чисел от A до B
# включительно.

A = 1
B = 10
total_sum = 0

for i in range (A, B + 1):
    total_sum += i

print(f"Сумма всех целых чисел от {A} до {B}: {total_sum}")

# ?2
# Найти сумму всех натуральных чисел от A до B

# 3
# Найти произведение положительных, сумму и количество отрицательных
# из 10 введенных целых значений.

# 4
# Дан словарь пловцов с их результатами. Напечатать лучший результат
# заплыва среди 6 участников.
# Бекиш Александр - 21,07
# Будник Алексей - 20,34
# Гребень Анастасия - 22,12
# Давидович Татьяна - 30
# Дешук Дмитрий - 24.01
# Казак Анна - 28,17
# 5
# Есть массив чисел. Известно, что каждое число в этом массиве имеет пару,
# кроме одного: [1, 5, 2, 9, 2, 9, 1] => 5 Напишите программу, которая будет выводить
# уникальное число




# Цикл while
# 1
# Дано число N. Найти произведение всех чисел от 0 до N.

N = 20
i = 0

while i <= 20:
    i *= i
    print(i)
    break # Все произведения = 0

# 2
# Поле засеяли цветами двух сортов на площади S1 и S2. Каждый год
# площадь цветов первого сорта увеличивается вдвое, а площадь второго сорта
# увеличивается втрое. Через сколько лет площадь первых сортов будет
# составлять меньше 10% от площади вторых сортов.

var_s1 = 5
var_s2 = 3
years = 0

while var_s1 >= 0.1 * var_s2:
        var_s1 *= 2
        var_s2 *= 3
        years += 1

print(f"Через {years} лет площадь первого сорта станет меньше 10% площади второго сорта.")

# 3
# Дано целое число N (>0). Используя операции деления нацело и взятия
# остатка от деления, найти количество и сумму его цифр.

N = int(input("Введите число N (> 0): "))

if N <= 0:
    print("Число должно быть больше 0.")
else:
    digit_sum = 0
    digit_count = 0

    while N > 0:
        last_digit = N % 10
        digit_sum += last_digit
        digit_count += 1
        N //= 10

    print(f"Количество цифр: {digit_count}")
    print(f"Сумма цифр: {digit_sum}")


# 4
# Деду M лет, а внуку N лет. Через сколько лет дед станет вдвое старше
# внука. И сколько при этом лет будет деду и внуку.

